Revit 2026 API

# CustomInitialColor Class

---

This class encapsulates a custom initial lighting color.

SystemObject Autodesk.Revit.DB.LightingInitialColor Autodesk.Revit.DB.LightingCustomInitialColor

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CustomInitialColor : InitialColor
```
```vb
Public Class CustomInitialColor
	Inherits InitialColor
```
```cpp
public ref class CustomInitialColor : public InitialColor
```
```fsharp
type CustomInitialColor =
    class
        inherit InitialColor
    end
```

The CustomInitialColor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CustomInitialColor(CustomInitialColor) | Creates a copy of the given custom initial color |
|  | CustomInitialColor(Double) | Creates a custom initial color set to the given color |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from InitialColor) |
|  | Temperature | The custom color temperature value. |
|  | TemperatureValue | The light color temperature value in Kelvins. (Inherited from InitialColor) |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the InitialColor derived object. (Inherited from InitialColor) |
|  | Dispose | (Inherited from InitialColor) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This color is called an initial color because a color filter can also be added to modify the color.

#### Reference

Autodesk.Revit.DB.Lighting Namespace